[{"insert":"Intangible Interactions Week "},{"insert":"9"},{"insert":"\n"},{"insert":"Project 3 proposal"},{"attributes":{"header":1},"insert":"\n"},{"insert":"It's the pandemic, I'm at home all day interacting with my computer, I access my world, almost exclusively from my computer. For this final project, I would like to solve one of two pain points that I have with my computer. (I haven't decided which one to do yet.)\nProblem 1"},{"attributes":{"header":2},"insert":"\n"},{"insert":"Navigating and manipulating things on a screen feels very fatiguing. Or in real life, when you move your hands, it's clear what the result of that action will be. If you move a piece of paper from Point A to Point B, then the paper paper moves to Point B. If you nudge the paper up a little, then it will move up slightly. If you take a pencil and drag across the paper, then it will draw a line.\nThe computer desktop doesn't work the same way. Sometimes you try to drag something and then discover that it's not allowed to be dragged. Sometimes you scroll and then suddenly an ad fills up the screen. Sometimes you mean to bring a window forward and accidentally click on a button. Our actions aren't as tied to the result, unlike the real world. I'm wondering if a series of external controls can help make this problem better.\nProblem 2"},{"attributes":{"header":2},"insert":"\n"},{"insert":"A much more straightforward problem — I want to very easily mute and unmute myself on video calls and potentially really quickly turn on and off my camera as well.\nWhen we're expected to interact with each other online with the same fidelity of real-life interactions, it's a little jarring that these simple ways to control our digital presence are primarily locked behind a modal activity of first bringing Zoom  (or whatever other video conferencing app) to the front, checking if the mute button is already clicked, and then clicking it if it is not. That's a lot of overhead that should not exist in the first place.\n "},{"attributes":{"header":2},"insert":"\n"},{"insert":"I will pick one of these two problems, and then decide how to implement intangible controls. Both of these can be solved with tangible controls as well, but the I am preferring to use intangible controls:\nTo remove an extra level of indirection."},{"attributes":{"list":"bullet"},"insert":"\n"},{"insert":"To make the solution either more portable or possible to be interacted with without the user sitting at their desk."},{"attributes":{"list":"bullet"},"insert":"\n"},{"insert":"Because a tangible solution for the second problem "},{"attributes":{"link":"https://www.amazon.com/Linkidea-Microphone-Compatible-Controller-Conference/dp/B08MFB72DW"},"insert":"already exists"},{"insert":" 😀"},{"attributes":{"list":"bullet"},"insert":"\n"}]
