[{"insert":"Intangible Interactions Week "},{"insert":"7"},{"insert":"\n"},{"attributes":{"italic":true},"insert":"Make a brief blog post about your tour to the exhibition, answering some of the questions below:"},{"insert":"\n"},{"attributes":{"italic":true},"insert":"Which exhibition did you see? How did you feel about the show? "},{"insert":"\n I saw the \"seeing machines\" virtual exhibit, featuring camera-activated works from Zach Leiberman and Gilman Levin."},{"attributes":{"list":"bullet"},"insert":"\n"},{"insert":"Most of the projects all involved taking a video feed as input and transforming it in some way. Levin's Snout was quite different — it is a giant roof-mounted  pseudo-organism that responds to visual stimuli."},{"attributes":{"list":"bullet"},"insert":"\n"},{"attributes":{"italic":true},"insert":"What is your favorite work if you had? "},{"insert":"\nLevin's Augmented Hand Series was the most thought-provoking for me."},{"attributes":{"list":"bullet"},"insert":"\n"},{"insert":{"image":"https://static.slab.com/prod/uploads/xrfkaonr/posts/images/6HlzPBfaxzQlJnKClckz7A78.jpg"}},{"attributes":{"italic":true},"insert":"What did you like about the piece? "},{"insert":"\nThe piece uses an all-too-familiar sensor (a camera), and the interaction \"place hand under screen\" is simple as well. The piece feels powerful because the occlusion of the user's hand, combined with the placement of the virtual hand in the same position, leads to a illusion of feeling like the user's real hand has actually been transformed. It's a simple trick that makes one think about where their sense of self comes from."},{"attributes":{"list":"bullet"},"insert":"\n"},{"insert":"I love that the amusement that this piece generates is not from its use of novel or rare input/output, or its extravagance, but entirely from placement."},{"attributes":{"list":"bullet"},"insert":"\n"},{"attributes":{"italic":true},"insert":"How is intangible interaction used in the piece? "},{"insert":"\nA camera takes a live video feed of the user's hand as the user places it underneath a surface. This is the only input to the system."},{"attributes":{"list":"bullet"},"insert":"\n"},{"attributes":{"italic":true},"insert":"If you were the artist, what would you have done differently?"},{"insert":"\nThe display is mounted at an angle. If I could iterate on this piece, I would mount the screen flat, such that the virtual hand is closer in position to where the real hand is. I wonder if it's possible to use the projection technique known as "},{"attributes":{"link":"https://en.wikipedia.org/wiki/Pepper%27s_ghost"},"insert":"Pepper's Ghost"},{"insert":" to make the virtual hand seem 3-dimensional as well."},{"attributes":{"list":"bullet"},"insert":"\n"}]
